Repository: joey-barbier/MainOrNot
Catalog: Concurrency/Common/Localization/Localizable.xcstrings
Source language: fr
Languages: de, en, es, ja, pt_br

# detached.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Pas d'impact significatif ici • DAI (Default Actor Isolation) : - nonisolated → Task.detached reste en arrière-plan - MainActor → Task.detached peut revenir MainThread ⚠️ PIÈGE CRITIQUE : Même Task.detached + struct @MainActor = retour MainThread !
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Keine signifikante Auswirkung hier • DAI (Default Actor Isolation) : - nonisolated → Task.detached bleibt im Hintergrund - MainActor → Task.detached kann MainThread zurückgeben ⚠️ KRITISCHE FALLE: Selbst Task.detached + struct @MainActor = Rückkehr MainThread!
en: Swift 6 flags impact : • AC (Approachable Concurrency) : No significant impact here • DAI (Default Actor Isolation) : - nonisolated → Task.detached stays background - MainActor → Task.detached may return MainThread ⚠️ CRITICAL TRAP: Even Task.detached + struct @MainActor = return MainThread!
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Sin impacto significativo aquí • DAI (Default Actor Isolation) : - nonisolated → Task.detached permanece en segundo plano - MainActor → Task.detached puede volver MainThread ⚠️ TRAMPA CRÍTICA: ¡Incluso Task.detached + struct @MainActor = retorna MainThread!
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : ここでは大きな影響なし • DAI (Default Actor Isolation) : - nonisolated → Task.detachedはバックグラウンドのまま - MainActor → Task.detachedはMainThreadを返す可能性 ⚠️ 重要な落とし穴: Task.detached + struct @MainActor でもMainThreadに戻ります！
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Sem impacto significativo aqui • DAI (Default Actor Isolation) : - nonisolated → Task.detached permanece em segundo plano - MainActor → Task.detached pode retornar MainThread ⚠️ ARMADILHA CRÍTICA: Mesmo Task.detached + struct @MainActor = retorna MainThread!

# lifecycle.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore les avertissements sur les Tasks non gérées • DAI (Default Actor Isolation) : - MainActor → Les Tasks héritent de MainActor - nonisolated → Tasks en arrière-plan ⚠️ L'isolation n'affecte pas le problème de cycle de vie ! Le nettoyage reste nécessaire dans tous les cas.
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Warnungen bei unverwalteten Tasks • DAI (Default Actor Isolation) : - MainActor → Tasks erben von MainActor - nonisolated → Tasks im Hintergrund ⚠️ Isolation beeinflusst nicht das Lebenszyklus-Problem! Bereinigung bleibt in allen Fällen notwendig.
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves warnings on unmanaged Tasks • DAI (Default Actor Isolation) : - MainActor → Tasks inherit from MainActor - nonisolated → Tasks in background ⚠️ Isolation doesn't affect the lifecycle problem! Cleanup remains necessary in all cases.
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora las advertencias sobre Tasks no gestionadas • DAI (Default Actor Isolation) : - MainActor → Las Tasks heredan de MainActor - nonisolated → Tasks en segundo plano ⚠️ ¡El aislamiento no afecta el problema del ciclo de vida! La limpieza sigue siendo necesaria en todos los casos.
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : 管理されていないTaskの警告を改善 • DAI (Default Actor Isolation) : - MainActor → TaskはMainActorから継承 - nonisolated → バックグラウンドでTask ⚠️ 分離はライフサイクル問題に影響しません！ クリーンアップはすべての場合で必要です。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora avisos sobre Tasks não gerenciadas • DAI (Default Actor Isolation) : - MainActor → Tasks herdam do MainActor - nonisolated → Tasks em segundo plano ⚠️ O isolamento não afeta o problema do ciclo de vida! Limpeza permanece necessária em todos os casos.

# nonisolated.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore les diagnostics d'isolation pour nonisolated • DAI (Default Actor Isolation) : - nonisolated → Fonctionne normalement - MainActor → nonisolated devient crucial pour l'opt-out 🔄 CONCEPTS CLÉS : • nonisolated = Supprime l'isolation (accès synchrone direct) • @concurrent = Conserve l'isolation + exécution en arrière-plan • Ne les confondez pas : usages complètement différents !
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Isolationsdiagnose für nonisolated • DAI (Default Actor Isolation) : - nonisolated → Funktioniert normal - MainActor → nonisolated wird entscheidend für Opt-out 🔄 SCHLÜSSELKONZEPTE: • nonisolated = Entfernt Isolation (direkter synchroner Zugriff) • @concurrent = Behält Isolation + Hintergrundausführung • Nicht verwechseln: völlig unterschiedliche Verwendungen!
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves isolation diagnostics for nonisolated • DAI (Default Actor Isolation) : - nonisolated → Works normally - MainActor → nonisolated becomes crucial for opt-out 🔄 KEY CONCEPTS: • nonisolated = Removes isolation (direct synchronous access) • @concurrent = Keeps isolation + background execution • Don't confuse the two: completely different usages!
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora diagnósticos de aislamiento para nonisolated • DAI (Default Actor Isolation) : - nonisolated → Funciona normalmente - MainActor → nonisolated se vuelve crucial para opt-out 🔄 CONCEPTOS CLAVE: • nonisolated = Elimina aislamiento (acceso síncrono directo) • @concurrent = Mantiene aislamiento + ejecución en segundo plano • ¡No los confundas: usos completamente diferentes!
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : nonisolatedの分離診断を改善 • DAI (Default Actor Isolation) : - nonisolated → 正常に動作 - MainActor → nonisolatedはopt-outに重要 🔄 重要な概念: • nonisolated = 分離を削除（直接同期アクセス） • @concurrent = 分離を保持 + バックグラウンド実行 • 混同しないで：全く異なる使用法です！
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora diagnósticos de isolamento para nonisolated • DAI (Default Actor Isolation) : - nonisolated → Funciona normalmente - MainActor → nonisolated torna-se crucial para opt-out 🔄 CONCEITOS-CHAVE: • nonisolated = Remove isolamento (acesso síncrono direto) • @concurrent = Mantém isolamento + execução em segundo plano • Não confunda: usos completamente diferentes!

# taskgroup.flags
source: Impact des flags Swift 6 : • AC (Approachable Concurrency) : Améliore l'inférence de type pour TaskGroup • DAI (Default Actor Isolation) : - nonisolated → TaskGroup en arrière-plan - MainActor → TaskGroup hérite MainActor (avertissement performance !) 💡 ASTUCE : TaskGroup excellent pour nombre dynamique de tâches. Pour nombre fixe, préférez async let (plus simple).
de: Swift 6 Flags Auswirkungen : • AC (Approachable Concurrency) : Verbessert Typinferenz für TaskGroup • DAI (Default Actor Isolation) : - nonisolated → TaskGroup im Hintergrund - MainActor → TaskGroup erbt MainActor (Performance-Warnung!) 💡 TIPP: TaskGroup ausgezeichnet für dynamische Taskanzahl. Für feste Anzahl async let bevorzugen (einfacher).
en: Swift 6 flags impact : • AC (Approachable Concurrency) : Improves type inference for TaskGroup • DAI (Default Actor Isolation) : - nonisolated → TaskGroup in background - MainActor → TaskGroup inherits MainActor (performance warning!) 💡 TIP: TaskGroup excellent for dynamic number of tasks. For fixed number, prefer async let (simpler).
es: Impacto de flags Swift 6 : • AC (Approachable Concurrency) : Mejora inferencia de tipos para TaskGroup • DAI (Default Actor Isolation) : - nonisolated → TaskGroup en segundo plano - MainActor → TaskGroup hereda MainActor (¡advertencia de rendimiento!) 💡 CONSEJO: TaskGroup excelente para número dinámico de tareas. Para número fijo, prefiere async let (más simple).
ja: Swift 6フラグの影響 : • AC (Approachable Concurrency) : TaskGroupの型推論を改善 • DAI (Default Actor Isolation) : - nonisolated → TaskGroupはバックグラウンド - MainActor → TaskGroupはMainActorを継承（パフォーマンス警告！） 💡 ヒント: TaskGroupは動的なタスク数に最適です。 固定数にはasync letを推奨（より簡単）。
pt_br: Impacto das flags Swift 6 : • AC (Approachable Concurrency) : Melhora inferência de tipos para TaskGroup • DAI (Default Actor Isolation) : - nonisolated → TaskGroup em segundo plano - MainActor → TaskGroup herda MainActor (aviso de performance!) 💡 DICA: TaskGroup excelente para número dinâmico de tarefas. Para número fixo, prefira async let (mais simples).

# lifecycle.objective
source: Objectif de cycle de vie
de: Lebenszyklus Ziel
en: Lifecycle objective
es: Objetivo de ciclo de vida
ja: ライフサイクルの目的
pt_br: Objetivo de ciclo de vida

# lifecycle.validation
source: Validation de cycle de vie
de: Lebenszyklus Validierung
en: Lifecycle validation
es: Validación de ciclo de vida
ja: ライフサイクルの検証
pt_br: Validação de ciclo de vida

# log.end
source: ✅ Exécution terminée
de: ✅ Ausführung abgeschlossen
en: ✅ Execution completed
es: ✅ Ejecución completada
ja: ✅ 実行完了
pt_br: ✅ Execução concluída

# log.error
source: ❌ Erreur: %@
de: ❌ Fehler: %@
en: ❌ Error: %@
es: ❌ Error: %@
ja: ❌ エラー: %@
pt_br: ❌ Erro: %@

# log.start
source: 🚀 Début de l'exécution
de: 🚀 Ausführung gestartet
en: 🚀 Execution started
es: 🚀 Ejecución iniciada
ja: 🚀 実行開始
pt_br: 🚀 Execução iniciada

# Logs
source: Journaux
de: Protokolle
en: Logs
es: Registros
ja: ログ
pt_br: Registros

# mainactor.objective
source: Objectif de MainActor
de: MainActor Ziel
en: MainActor objective
es: Objetivo de MainActor
ja: MainActorの目的
pt_br: Objetivo de MainActor

# mainactor.validation
source: Validation de MainActor
de: MainActor Validierung
en: MainActor validation
es: Validación de MainActor
ja: MainActorの検証
pt_br: Validação de MainActor

# menu.basics
source: 1. Concepts de base
de: 1. Grundkonzepte
en: 1. Basic Concepts
es: 1. Conceptos Básicos
ja: 1. 基本概念
pt_br: 1. Conceitos Básicos

# menu.tasks
source: 2. Gestion des tâches
de: 2. Task-Verwaltung
en: 2. Task Management
es: 2. Gestión de Tareas
ja: 2. タスク管理
pt_br: 2. Gerenciamento de Tarefas

# nonisolated.objective
source: Objectif de non-isolation
de: Nicht-isoliert Ziel
en: Nonisolated objective
es: Objetivo de no aislado
ja: 非分離の目的
pt_br: Objetivo de não isolado

# nonisolated.validation
source: Validation de non-isolation
de: Nicht-isoliert Validierung
en: Nonisolated validation
es: Validación de no aislado
ja: 非分離の検証
pt_br: Validação de não isolado

# Objective
source: Objectif
de: Ziel
en: Objective
es: Objetivo
ja: 目的
pt_br: Objetivo

# Production notes
source: Notes de production
de: Produktionshinweise
en: Production notes
es: Notas de producción
ja: プロダクションノート
pt_br: Notas de produção

# Running...
source: En cours d'exécution...
de: Läuft...
en: Running...
es: Ejecutando...
ja: 実行中...
pt_br: Executando...

# section.flags.impact
source: Impact des flags Swift 6
de: Swift 6 Flags Auswirkung
en: Swift 6 Flags Impact
es: Impacto de Flags Swift 6
ja: Swift 6 フラグの影響
pt_br: Impacto das Flags Swift 6

# section.objective
source: Objectif
de: Ziel
en: Objective
es: Objetivo
ja: 目的
pt_br: Objetivo

# section.production.notes
source: Notes de production
de: Produktionshinweise
en: Production Notes
es: Notas de Producción
ja: 本番環境での注意
pt_br: Notas de Produção

# section.validation
source: Points de validation
de: Validierungspunkte
en: Validation Points
es: Puntos de Validación
ja: 検証ポイント
pt_br: Pontos de Validação

# Swift 6 flags impact
source: Impact des drapeaux Swift 6
de: Swift 6 Flags Auswirkungen
en: Swift 6 flags impact
es: Impacto de banderas Swift 6
ja: Swift 6 フラグの影響
pt_br: Impacto das flags do Swift 6

# Swift Concurrency
source: Concurrence Swift
de: Swift-Nebenläufigkeit
en: Swift Concurrency
es: Concurrencia Swift
ja: Swift並行処理
pt_br: Concorrência Swift

# taskgroup.objective
source: Objectif de groupe de tâches
de: Aufgabengruppe Ziel
en: Task group objective
es: Objetivo de grupo de tareas
ja: タスクグループの目的
pt_br: Objetivo de grupo de tarefas

# taskgroup.validation
source: Validation de groupe de tâches
de: Aufgabengruppe Validierung
en: Task group validation
es: Validación de grupo de tareas
ja: タスクグループの検証
pt_br: Validação de grupo de tarefas

# taskvs.objective
source: Objectif de Task vs Detached
de: Task vs Detached Ziel
en: Task vs Detached objective
es: Objetivo de Task vs Detached
ja: Task vs Detachedの目的
pt_br: Objetivo de Task vs Detached

# taskvs.validation
source: Validation de Task vs Detached
de: Task vs Detached Validierung
en: Task vs Detached validation
es: Validación de Task vs Detached
ja: Task vs Detachedの検証
pt_br: Validação de Task vs Detached

# Validation points
source: Points de validation
de: Validierungspunkte
en: Validation points
es: Puntos de validación
ja: 検証ポイント
pt_br: Pontos de validação

# asynclet.validation.1
source: Le temps total ≈ au plus long téléchargement
de: Gesamtzeit ≈ längster Download
en: Total time ≈ longest download
es: Tiempo total ≈ descarga más larga
ja: 合計時間 ≈ 最長ダウンロード
pt_br: Tempo total ≈ download mais longo

# asynclet.validation.2
source: Les deux opérations s'exécutent en parallèle
de: Beide Operationen laufen parallel
en: Both operations execute in parallel
es: Ambas operaciones se ejecutan en paralelo
ja: 両方の操作が並列で実行される
pt_br: Ambas operações executam em paralelo

# asynclet.validation.3
source: async let démarre immédiatement, await attend les résultats
de: async let startet sofort, await wartet auf Ergebnisse
en: async let starts immediately, await waits for results
es: async let inicia inmediatamente, await espera los resultados
ja: async letは即座に開始、awaitは結果を待つ
pt_br: async let inicia imediatamente, await aguarda os resultados

# asynclet.validation.4
source: UI non bloquée : Task.sleep() suspend sans bloquer le main thread
de: UI nicht blockiert: Task.sleep() pausiert ohne Main-Thread zu blockieren
en: UI not blocked: Task.sleep() suspends without blocking main thread
es: UI no bloqueada: Task.sleep() suspende sin bloquear el hilo principal
ja: UIはブロックされない：Task.sleep()はメインスレッドをブロックせずに一時停止
pt_br: UI não bloqueada: Task.sleep() suspende sem bloquear a thread principal

# asynclet.validation.5
source: Concurrence coopérative : await permet au système de gérer d'autres tâches
de: Kooperative Nebenläufigkeit: await ermöglicht System andere Aufgaben zu handhaben
en: Cooperative concurrency: await allows system to handle other tasks
es: Concurrencia cooperativa: await permite al sistema manejar otras tareas
ja: 協調的並行性：awaitによりシステムが他のタスクを処理可能
pt_br: Concorrência cooperativa: await permite ao sistema gerenciar outras tarefas

# cancellation.validation.1
source: Les logs « working… » cessent après cancel()
de: Die «working…» Logs stoppen nach cancel()
en: The «working…» logs stop after cancel()
es: Los logs «working…» se detienen después de cancel()
ja: cancel()後に«working…»ログが停止
pt_br: Os logs «working…» param após cancel()

# cancellation.validation.2
source: La tâche vérifie coopérativement son statut d'annulation
de: Die Aufgabe prüft kooperativ ihren Abbruchstatus
en: The task cooperatively checks its cancellation status
es: La tarea verifica cooperativamente su estado de cancelación
ja: タスクが協調的にキャンセル状態をチェック
pt_br: A tarefa verifica cooperativamente seu status de cancelamento

# cancellation.validation.3
source: Task.checkCancellation() lance une erreur si annulée
de: Task.checkCancellation() wirft Fehler wenn abgebrochen
en: Task.checkCancellation() throws an error if cancelled
es: Task.checkCancellation() lanza error si cancelada
ja: Task.checkCancellation()はキャンセル時にエラーを投げる
pt_br: Task.checkCancellation() lança erro se cancelada

# concurrent.validation.1
source: Thread avant : true (MainActor)
de: Thread vorher: true (MainActor)
en: Thread before: true (MainActor)
es: Thread antes: true (MainActor)
ja: 実行前スレッド：true（MainActor）
pt_br: Thread antes: true (MainActor)

# concurrent.validation.2
source: Pendant heavy() : false (background thread)
de: Während heavy(): false (Hintergrund-Thread)
en: During heavy(): false (background thread)
es: Durante heavy(): false (hilo en segundo plano)
ja: heavy()実行中：false（バックグラウンドスレッド）
pt_br: Durante heavy(): false (thread em segundo plano)

# concurrent.validation.3
source: Thread après : true (retour sur MainActor)
de: Thread nachher: true (Rückkehr zu MainActor)
en: Thread after: true (return to MainActor)
es: Thread después: true (retorno a MainActor)
ja: 実行後スレッド：true（MainActorに戻る）
pt_br: Thread depois: true (retorno ao MainActor)

# concurrent.validation.4
source: UI non bloquée pendant le calcul intensif
de: UI nicht blockiert während intensiver Berechnung
en: UI not blocked during intensive calculation
es: UI no bloqueada durante el cálculo intensivo
ja: 集約的な計算中もUIはブロックされない
pt_br: UI não bloqueada durante cálculo intensivo

# datarace.validation.1
source: Sans acteur : valeur aléatoire (data race)
de: Ohne Actor: zufälliger Wert (Data Race)
en: Without actor: random value (data race)
es: Sin actor: valor aleatorio (data race)
ja: actorなし：ランダムな値（データ競合）
pt_br: Sem actor: valor aleatório (data race)

# datarace.validation.2
source: Avec acteur : toujours 10 000 (accès sérialisé)
de: Mit Actor: immer 10.000 (serialisierter Zugriff)
en: With actor: always 10,000 (serialized access)
es: Con actor: siempre 10.000 (acceso serializado)
ja: actorあり：常に10,000（シリアル化されたアクセス）
pt_br: Com actor: sempre 10.000 (acesso serializado)

# datarace.validation.3
source: L'actor protège automatiquement contre les accès concurrents
de: Actor schützt automatisch vor gleichzeitigem Zugriff
en: Actor automatically protects against concurrent access
es: El actor protege automáticamente contra accesos concurrentes
ja: actorは並行アクセスから自動的に保護
pt_br: Actor protege automaticamente contra acessos concorrentes

# deinit.validation.1
source: Aucun warning de data-race du compilateur
de: Keine Data-Race-Warnungen vom Compiler
en: No data-race warnings from compiler
es: Sin advertencias de data-race del compilador
ja: コンパイラからのデータ競合警告なし
pt_br: Sem avisos de data-race do compilador

# deinit.validation.2
source: cancel() exécuté de manière thread-safe
de: cancel() thread-sicher ausgeführt
en: cancel() executed in thread-safe manner
es: cancel() ejecutado de manera thread-safe
ja: cancel()がスレッドセーフに実行
pt_br: cancel() executado de maneira thread-safe

# deinit.validation.3
source: Cleanup automatique lors de la destruction de l'actor
de: Automatische Bereinigung bei Actor-Zerstörung
en: Automatic cleanup when actor is destroyed
es: Limpieza automática cuando se destruye el actor
ja: actor破棄時の自動クリーンアップ
pt_br: Limpeza automática quando o actor é destruído

# lifecycle.validation.1
source: ⚠️ Tasks continuent par défaut après navigation back
de: ⚠️ Tasks laufen standardmäßig nach Navigation zurück weiter
en: ⚠️ Tasks continue by default after navigation back
es: ⚠️ Las Tasks continúan por defecto después de navegación hacia atrás
ja: ⚠️ Taskはデフォルトでナビゲーションバック後も継続
pt_br: ⚠️ Tasks continuam por padrão após navegação de volta

# lifecycle.validation.2
source: Solution 1 : Stocker Task et annuler dans .onDisappear
de: Lösung 1: Task speichern und in .onDisappear abbrechen
en: Solution 1: Store Task and cancel in .onDisappear
es: Solución 1: Almacenar Task y cancelar en .onDisappear
ja: 解決策1：Taskを保存し.onDisappearでキャンセル
pt_br: Solução 1: Armazenar Task e cancelar em .onDisappear

# lifecycle.validation.3
source: Solution 2 : ViewModel avec méthode cleanup()
de: Lösung 2: ViewModel mit cleanup() Methode
en: Solution 2: ViewModel with cleanup() method
es: Solución 2: ViewModel con método cleanup()
ja: 解決策2：cleanup()メソッド付きViewModel
pt_br: Solução 2: ViewModel com método cleanup()

# lifecycle.validation.4
source: Toujours gérer le lifecycle des Tasks longues
de: Immer den Lebenszyklus lang laufender Tasks verwalten
en: Always manage lifecycle of long-running Tasks
es: Siempre gestionar el ciclo de vida de Tasks de larga duración
ja: 長時間実行Taskのライフサイクルを常に管理
pt_br: Sempre gerenciar ciclo de vida de Tasks de longa duração

# lifecycle.validation.5
source: Pattern production : Repository/Interactor expose cleanup
de: Produktionsmuster: Repository/Interactor stellt cleanup zur Verfügung
en: Production pattern: Repository/Interactor exposes cleanup
es: Patrón de producción: Repository/Interactor expone cleanup
ja: 本番パターン：Repository/Interactorがcleanupを公開
pt_br: Padrão de produção: Repository/Interactor expõe cleanup

# mainactor.validation.2
source: DAI = Default Actor Isolation (MainActor ou nonisolated)
de: DAI = Default Actor Isolation (MainActor oder nonisolated)
en: DAI = Default Actor Isolation (MainActor or nonisolated)
es: DAI = Default Actor Isolation (MainActor o nonisolated)
ja: DAI = Default Actor Isolation (MainActor または nonisolated)

# mainactor.validation.3
source: Task.detached ne rebascule sur MainActor que si DAI=MainActor
de: Task.detached wechselt nur dann zurück zu MainActor, wenn DAI=MainActor
en: Task.detached only switches back to MainActor if DAI=MainActor
es: Task.detached solo vuelve a MainActor si DAI=MainActor
ja: Task.detachedはDAI=MainActorの場合のみMainActorに戻る
pt_br: Task.detached só volta para MainActor se DAI=MainActor

# mainactor.validation.4
source: Thread.isMainThread peut être false même sur MainActor (fast-hop iOS 17+)
de: Thread.isMainThread kann auch auf MainActor false sein (fast-hop iOS 17+)
en: Thread.isMainThread can be false even on MainActor (fast-hop iOS 17+)
es: Thread.isMainThread puede ser false incluso en MainActor (fast-hop iOS 17+)
ja: Thread.isMainThreadはMainActor上でもfalseになることがある (fast-hop iOS 17+)
pt_br: Thread.isMainThread pode ser false mesmo no MainActor (fast-hop iOS 17+)

# nonisolated.validation.1
source: Accès synchrone sans await aux propriétés nonisolated
de: Synchroner Zugriff ohne await auf nonisolated Eigenschaften
en: Synchronous access without await to nonisolated properties
es: Acceso síncrono sin await a propiedades nonisolated
ja: nonisolatedプロパティへのawaitなしの同期アクセス
pt_br: Acesso síncrono sem await a propriedades nonisolated

# nonisolated.validation.2
source: nonisolated supprime complètement l'isolation de l'actor
de: nonisolated entfernt Actor-Isolation vollständig
en: nonisolated completely removes actor isolation
es: nonisolated elimina completamente el aislamiento del actor
ja: nonisolatedはactor分離を完全に削除
pt_br: nonisolated remove completamente o isolamento do actor

# nonisolated.validation.3
source: ⚠️ Différence : nonisolated ≠ @concurrent
de: ⚠️ Unterschied: nonisolated ≠ @concurrent
en: ⚠️ Difference: nonisolated ≠ @concurrent
es: ⚠️ Diferencia: nonisolated ≠ @concurrent
ja: ⚠️ 違い：nonisolated ≠ @concurrent
pt_br: ⚠️ Diferença: nonisolated ≠ @concurrent

# nonisolated.validation.4
source: nonisolated = pas d'isolation | @concurrent = isolation + background
de: nonisolated = keine Isolation | @concurrent = Isolation + Hintergrund
en: nonisolated = no isolation | @concurrent = isolation + background
es: nonisolated = sin aislamiento | @concurrent = aislamiento + segundo plano
ja: nonisolated = 分離なし | @concurrent = 分離 + バックグラウンド
pt_br: nonisolated = sem isolamento | @concurrent = isolamento + segundo plano

# nonisolated.validation.5
source: Usage : métadonnées, constantes, propriétés calculées
de: Verwendung: Metadaten, Konstanten, berechnete Eigenschaften
en: Usage: metadata, constants, computed properties
es: Uso: metadatos, constantes, propiedades calculadas
ja: 用途：メタデータ、定数、計算プロパティ
pt_br: Uso: metadados, constantes, propriedades computadas

# taskgroup.validation.1
source: TaskGroup gère un nombre dynamique de tâches parallèles
de: TaskGroup verwaltet dynamische Anzahl paralleler Aufgaben
en: TaskGroup manages a dynamic number of parallel tasks
es: TaskGroup maneja número dinámico de tareas paralelas
ja: TaskGroupは動的数の並列タスクを処理
pt_br: TaskGroup gerencia número dinâmico de tarefas paralelas
